In [1]:
import pandas as pd

## create DataFrame
- row wise
- column wise

In [4]:
## row wise creation

df_1 = pd.DataFrame([[10, 20], [30, 35], [25, 30]], columns=["A", "B"])

df_1

    A   B
0  10  20
1  30  35
2  25  30

In [5]:
## column wise creation

df_2 = pd.DataFrame({"A" : [10,30,25],
                     "B" : [20,35,30]})

df_2

    A   B
0  10  20
1  30  35
2  25  30

In [8]:
print(type(df_1.iloc[1]))   ## gives a row

print(type(df_2.iloc[1]))

print(type(df_1["A"]))

print(type(df_2["B"]))     ## gives a column

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [8]:
df = pd.read_csv("../datasets/GDP-countries.csv")

df   ## `df` is DataFrame

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [3]:
type(df)

pandas.core.frame.DataFrame

`df` is a collection of columnunar data which are in itself pandas' __Series__ type. Cummulatively these Series type column stacked together to form a DataFrame.

<br>

#### Access data of 1 column :

`dataframe_variable["column_name"]`

This is just like accessing a dictionary's value via its corresponding key.

In [16]:
df["year"]

## returns a Series type

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

<br>

#### Access data of multiple columns

- pass all column names in a list.
- column names can be repeated too.

In [9]:
df[["country" , "year" , "life_exp" , "year"]]

          country  year  life_exp  year
0     Afghanistan  1952    28.801  1952
1     Afghanistan  1957    30.332  1957
2     Afghanistan  1962    31.997  1962
3     Afghanistan  1967    34.020  1967
4     Afghanistan  1972    36.088  1972
...           ...   ...       ...   ...
1699     Zimbabwe  1987    62.351  1987
1700     Zimbabwe  1992    60.377  1992
1701     Zimbabwe  1997    46.809  1997
1702     Zimbabwe  2002    39.989  2002
1703     Zimbabwe  2007    43.487  2007

[1704 rows x 4 columns]

In [17]:
type(df["year"])

pandas.core.series.Series

In [18]:
df["year"].dtype

dtype('int64')

<br>

#### Information provided by `.info()` :

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

More info on Pandas dtypes - https://pbpython.com/pandas_dtypes.html

<br>

#### Description of a dataframe :

- By default, the`.describe()` only gives info about numeric dtypes.<br>
- But to include the info of __object__ or __O__ dtype, mention it within the includes parameter.

In [20]:
df.describe()

             year    population     life_exp        gdp_cap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [22]:
df.describe(include=["object", "int64", "float64"])

## pass required dtypes as paraneters to .describe()

,country,year,population,continent,life_exp,gdp_cap
count,1704,1704.00000,1.704000e+03,1704,1704.000000,1704.000000
unique,142,NaN,NaN,5,NaN,NaN
top,Afghanistan,NaN,NaN,Africa,NaN,NaN
freq,12,NaN,NaN,624,NaN,NaN
mean,NaN,1979.50000,2.960121e+07,NaN,59.474439,7215.327081
std,NaN,17.26533,1.061579e+08,NaN,12.917107,9857.454543
min,NaN,1952.00000,6.001100e+04,NaN,23.599000,241.165876
25%,NaN,1965.75000,2.793664e+06,NaN,48.198000,1202.060309
50%,NaN,1979.50000,7.023596e+06,NaN,60.712500,3531.846988
75%,NaN,1993.25000,1.958522e+07,NaN,70.845500,9325.462346
max,NaN,2007.00000,1.318683e+09,NaN,82.603000,113523.132900

- Here, categorical dtypes are : "country" and "continent"
- `unique` attribute returns positive count of distinct values of a column. Works **only for categorical columns/attributes**; returns _NaN_ for numerical column. For eg, "country" has a unique value but "year" does not have a unique value. 
- `top` - mode value of column. Defined only for categorical columns.
- `freq` - is the freq of the `top` value, of a column. Defined only for categorical columns.
- `std` - standard deviation. Defined only for numerical columns.
- `mean` - mean of a numerical column.
- `min` and `max` - minimum and maximum value for a numerical column.
- `25%` , `50%` and `75%` - percentiles. Defined only for numerical columns.

In [23]:
df.shape

## (rows, columns)

(1704, 6)

#### Access the column names of `df` :

In [24]:
df.columns

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

In [32]:
df.keys()

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

<br>

#### Unique values in a column :

In [17]:
df["country"].unique()

## all unique values under "country" column

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [18]:
df["year"].unique()

## all unique values under "year" column

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

<br>

#### Number of unique values in a column :

- `.nunique()`

In [20]:
df["country"].nunique()

## number of unique countries = 142

142

In [21]:
df["year"].nunique()

12

<br>

#### Frequency of each unique record, present in a column
- `.value_counts()`

In [3]:
df["country"].value_counts()

## gives a Series object.
## frequency of each unique record under "country" column

## interestingly, here each country has frequency of 12

Afghanistan          12
Pakistan             12
New Zealand          12
Nicaragua            12
Niger                12
                     ..
Eritrea              12
Equatorial Guinea    12
El Salvador          12
Egypt                12
Zimbabwe             12
Name: country, Length: 142, dtype: int64

<br>

#### Rename a column
<code>
.rename(columns={ "old_col_name_1" : "new_col_name_1",
                  "new_col_name_2" : "new_col_name_2",
                  ... so on
                } , axis=1)
 </code>
 
- renaming of column is a horizontal operation, so `axis=1` must be declared.
- `inplace=True` can be specified because this is NOT a permanent operation on `df`.

In [9]:
df.rename(columns = {"country":"country_name", "life_exp":"life_expectancy_in_years"}, axis=1, inplace=True)

In [10]:
df

,country_name,year,population,continent,life_expectancy_in_years,gdp_cap
0,Afghanistan,1952,8425333,Asia,28.801,779.445314
1,Afghanistan,1957,9240934,Asia,30.332,820.853030
2,Afghanistan,1962,10267083,Asia,31.997,853.100710
3,Afghanistan,1967,11537966,Asia,34.020,836.197138
4,Afghanistan,1972,13079460,Asia,36.088,739.981106
...,...,...,...,...,...,...
1699,Zimbabwe,1987,9216418,Africa,62.351,706.157306
1700,Zimbabwe,1992,10704340,Africa,60.377,693.420786
1701,Zimbabwe,1997,11404948,Africa,46.809,792.449960
1702,Zimbabwe,2002,11926563,Africa,39.989,672.038623
1703,Zimbabwe,2007,12311143,Africa,43.487,469.709298

<br>

#### Drop one or multiple column(s)
- `.drop()`
- specify `axis=1` because dropping a column is a horizontal operation.
- specify `inplace=True`, if you to need to preserve the changes made via drop.

In [11]:
df.columns

Index(['country_name', 'year', 'population', 'continent',
       'life_expectancy_in_years', 'gdp_cap'],
      dtype='object')

In [12]:
df.drop(columns=["continent" , "life_expectancy_in_years"], axis=1, inplace=True)

df.head()    ## Notice that above mentioned 2 columns are entirely dropped now.

  country_name  year  population     gdp_cap
0  Afghanistan  1952     8425333  779.445314
1  Afghanistan  1957     9240934  820.853030
2  Afghanistan  1962    10267083  853.100710
3  Afghanistan  1967    11537966  836.197138
4  Afghanistan  1972    13079460  739.981106

<br>
â›” If axis is not specified, following like error gets thrown :

In [26]:
df.drop("continent")

KeyError: "['continent'] not found in axis"

<br><br>

#### Add 1 new column

- `df["new_col_name"] = df[old_col_name] + some_data`<br>
(`dtype` of new_col_name and old_col_name MUST be same. Otherwise error results.)



- After some computation, a column's value can also be re-assigned back to itself :
`df["col_name"] = df["col_name"] + some_data`<br>
In this way, new data will overwrite previous data within same column.

In [15]:
df.head(2)

  country_name  year  population     gdp_cap
0  Afghanistan  1952     8425333  779.445314
1  Afghanistan  1957     9240934  820.853030

In [16]:
df["year_plus_7"] = df["year"] + 7

df.head(2)

  country_name  year  population     gdp_cap  year_plus_7
0  Afghanistan  1952     8425333  779.445314         1959
1  Afghanistan  1957     9240934  820.853030         1964

<br>

#### Delete/Drop 1 or multiple row(s)
- `df.drop([list_of_row_indices])`
- specify inplace=True if you want to preserve the change as permament
- Since default axis in drop operation is `0` i.e. vertical operation, hence axis is unneeded to be provided.

In [20]:
df.head()

  country_name  year  population     gdp_cap  year_plus_7
0  Afghanistan  1952     8425333  779.445314         1959
1  Afghanistan  1957     9240934  820.853030         1964
2  Afghanistan  1962    10267083  853.100710         1969
3  Afghanistan  1967    11537966  836.197138         1974
4  Afghanistan  1972    13079460  739.981106         1979

In [25]:
df.drop([2,4,5]).head()

## notice, index - 2,4,5 - have gone deleted.

  country_name  year  population     gdp_cap  year_plus_7
0  Afghanistan  1952     8425333  779.445314         1959
1  Afghanistan  1957     9240934  820.853030         1964
3  Afghanistan  1967    11537966  836.197138         1974
6  Afghanistan  1982    12881816  978.011439         1989
7  Afghanistan  1987    13867957  852.395945         1994

<br>

#### Drop row(s) based on one or more condition(s)

- fetch the index of such rows that satify the boolean mask (condition) - via `.index`.
- perform .drop on `axis=0` , since this is a vertical operation. Keep inplace-True if changes are to be kept permanent.


For eg, drop all such rows that have `year==1967`, i.e. exclude all such countries data belonging to 1967th year.

In [ ]:
df.drop(df[df["year"] == 1967].index, axis=0, inplace=True)

<hr>

# Understanding _"Series"_ data

In [27]:
country_series = df["country_name"]

country_series

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country_name, Length: 1704, dtype: object

Numbers occuring in the left column are the **Indexes**. Every data in country_name column is pointed by a unique index.

In NumPy too, we have such type of indexes - pointing to contiguous data - but, Jupyter don't display those indexes specifically unlike in Pandas.

- #### Accessing values using Indexes

In [28]:
country_series[6]

## returns the value at index - 6 - in the Series country_series

'Afghanistan'

In [29]:
country_series[6:11]

## returns a slice of values, of a Series, based on the mentioned indices

6     Afghanistan
7     Afghanistan
8     Afghanistan
9     Afghanistan
10    Afghanistan
Name: country_name, dtype: object

<br>

- #### Get the `.index` object, associated to your Series variable

In [30]:
country_series.index

RangeIndex(start=0, stop=1704, step=1)

<br>

- #### Change Indices of Series object

In below example, we'll change the Series's indices to now point from `5` to `1708`.<br>
Hence, accessing a value in manner - `country_series[3]`will throw error because index `3` won't be found.

In [31]:
import numpy as np

new_indices = np.arange(5, 1709)

country_series.index = new_indices          ## assign new indices to the Series's .index attribute

country_series.index

Int64Index([   5,    6,    7,    8,    9,   10,   11,   12,   13,   14,
            ...
            1699, 1700, 1701, 1702, 1703, 1704, 1705, 1706, 1707, 1708],
           dtype='int64', length=1704)

In [32]:
country_series

## notice here, indices are now changed - `5` to `1708`

5       Afghanistan
6       Afghanistan
7       Afghanistan
8       Afghanistan
9       Afghanistan
           ...
1704       Zimbabwe
1705       Zimbabwe
1706       Zimbabwe
1707       Zimbabwe
1708       Zimbabwe
Name: country_name, Length: 1704, dtype: object

<br>

- #### Nuances about Indexing and Slicing of a Series data

In [2]:
idx = range(1, 10)

data = pd.Series(["a","b","c","d","e","f","g","h","i"], index=idx)

Notice that **explicit** indexes in `data` start from 1 and not 0. Remember, `idx` indexes are explicitly defined by a user.

In [8]:
print(type(data))

data

<class 'pandas.core.series.Series'>

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

- Access an element of `data` Series, via a valid key :

In [32]:
data[4]    # Indexing - this index can be either explicit or implicit

'd'

- Access multiple elements via Slicing :

Notice here, element at index `4` does not get included in the result. Why so??

_It's because Slicing operates on __implicit indexes__ of `data`, not the __explicit__ ones.<br>And, implicit indexes in a Series always begin fron `0`._

In [33]:
data[4:7]   # Slicing

5    e
6    f
7    g
dtype: object

In [26]:
## example :

x = pd.Series(['MJ', 'is', 'greatest', 'performer', 'of', 'all', 'times'], index=[3, 8, 9, 2, 0, 4, -4])

print(x)

print("-" * 20)

print(x[1:4])

 3           MJ
 8           is
 9     greatest
 2    performer
 0           of
 4          all
-4        times
dtype: object
--------------------
8           is
9     greatest
2    performer
dtype: object

In [34]:
## example :

mj_series = pd.Series(['MJ', 'is', 'king', 'of', 'pop'], index=[3, 8, 2, 0, 2])

mj_series[2]

## returns a Series, with all such values whose explicit index = 2

2    king
2     pop
dtype: object

<br>

- Series datatype supports user-defined __explicit indexing__.
- If explicit indexes are not defined, Series would assign the indexes to itself, these are __implicit indexes__.
- Implicit indexes are always completely unique in nature.
- Explicit indexes can be of any data type, and support mixed data types, and can be repititve too.

In [47]:
## example :

pd.Series(("She", "sells", "sea", "shells", "on", "a", "sea", "shore"),
          index=("2", 3, 5.3, "hi", True, 3, "explicit indexes are weird", 3))

2                                She
3                              sells
5.3                              sea
hi                            shells
True                              on
3                                  a
explicit indexes are weird       sea
3                              shore
dtype: object

<br>

To overcome this confusion of explicit indexes, Pandas came up with the concept of loc and iloc.


## Concept of `iloc` and `loc` in <u>Series</u>

(_Not entirely true but, `i` in `iloc` means implicit._)


- `iloc` accepts implicit indexes.
- `loc` accepts explicit indexes.
- In Slicing, `iloc` considers the start inclusive whereas the end exclusive.<br>
While, `loc` considers start and end, both inclusive.


1. If Series, `S`, contains user-defined explicit indexes, then :
  - Access an element via either 2 ways => `S[explicit_id]` is also same as `S.loc[explicit_id]`


2. If Series, `S`, does NOT contain user-defined explicit indexes, then :
  - Access an element via either of 2 ways => `S[implicit_id]` is also same as `S.iloc[implicit_id]`


3. Simple convention is, in order to access an elemnt via `S[id]`, the `id` will be considered as an Explicit Index (only if it's defined by user while defining S), otherwise as Implicit index.

### âœ… General rule to remember : `loc` is OPTIMIZED and FASTER than - `iloc` and Direct Accessing via dataframe.

In [18]:
## example :

data = pd.Series(["a","b","c","d","e","f","g","h","i"],
           index=["A","B","C","D","E","F","G","H","I"])

Here,
- implicit indexes => 0 to 8
- explicit indexes => "A" to "I"

In [19]:
data

A    a
B    b
C    c
D    d
E    e
F    f
G    g
H    h
I    i
dtype: object

In [20]:
data.iloc[8]  ## indexing

'i'

In [22]:
data.loc["I"]  ## indexing

'i'

<br>

0:3 in `iloc` would give elements from implicit index `0` (inclusive) till `3` (exclusive).

In [17]:
data.iloc[:3]  ## slicing

5    a
6    b
7    c
dtype: object

<br>

"A" : "D" in `loc` would return elements from explicit index `A` till `D` both inclusive.

In [23]:
data.loc["A":"D"]  ## slicing

A    a
B    b
C    c
D    d
dtype: object

In [63]:
## example :

idx = range(5,15)
e = range(10)

x_1 = pd.Series(e, idx)

print(x_1)
print("-" * 10)

print(x_1[9], x_1.iloc[9], x_1.loc[9], "\n")      ## indexing

print(x_1[8:11], "\n")            ## slicing
print(x_1.loc[8:11], "\n")
print(x_1.iloc[8:11])

5     0
6     1
7     2
8     3
9     4
10    5
11    6
12    7
13    8
14    9
dtype: int64
----------
4 9 4

13    8
14    9
dtype: int64

8     3
9     4
10    5
11    6
dtype: int64

13    8
14    9
dtype: int64

In [65]:
## example :

x_2 = pd.Series(range(10,20))

print(x_2)
print("-" * 10)

print(x_2[3], x_2.iloc[3], x_2.loc[3], "\n")    ## indexing

print(x_2[4:7], "\n")            ## slicing
print(x_2.loc[4:7], "\n")
print(x_2.iloc[4:7])

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64
----------
13 13 13

4    14
5    15
6    16
dtype: int64

4    14
5    15
6    16
7    17
dtype: int64

4    14
5    15
6    16
dtype: int64

<br>

- #### Access multitple rows via `loc` & `iloc` in Series

In [66]:
## example :

data_2 = pd.Series(["a","b","c","d","e","f","g","h"],
             index=["A","B","C","D","E","F","G","H"])

data_2

A    a
B    b
C    c
D    d
E    e
F    f
G    g
H    h
dtype: object

In [67]:
data_2[['E','F','A']]

## direct access, via passing explicit indexes in a list

E    e
F    f
A    a
dtype: object

In [68]:
data_2[[3,2,1]]

## direct access, via implicit indexes in a list

D    d
C    c
B    b
dtype: object

In [70]:
data_2.loc[["E", "F", "A", "E"]]

## access via .loc

E    e
F    f
A    a
E    e
dtype: object

In [71]:
data_2.iloc[[3,2,1,4]]

## access via .iloc

D    d
C    c
B    b
E    e
dtype: object

<hr>

## Concept of `iloc` and `loc` in <u>DataFrame</u>

In [115]:
df = pd.read_csv("../datasets/GDP-countries.csv")

df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [121]:
## directly access a record of 'population' column, via Indexing

df["population"][1]

9240934

In [124]:
df.iloc[1]["population"]        ## here, .loc can also used because implicit and explicit indexes are same

9240934

<br>

- Access multiple rows of DataFrame, via `loc`
    - pass indexes in a list.

In [144]:
df.loc[[1, 70, 100]]       ## iloc and loc will produce same result because explicit & implicit indexes are same here

         country  year  population continent  life_exp       gdp_cap
1    Afghanistan  1957     9240934      Asia    30.332    820.853030
70     Australia  2002    19546792   Oceania    80.370  30687.754730
100   Bangladesh  1972    70759295      Asia    45.252    630.233627

In [145]:
df.loc[[1, 70, 100], "population":"gdp_cap"]      ## access certain columns via Slicing

     population continent  life_exp       gdp_cap
1       9240934      Asia    30.332    820.853030
70     19546792   Oceania    80.370  30687.754730
100    70759295      Asia    45.252    630.233627

In [146]:
df.loc[[1, 70, 100], ["population", "gdp_cap", "continent"]]      ## access only certain columns in random order

     population       gdp_cap continent
1       9240934    820.853030      Asia
70     19546792  30687.754730   Oceania
100    70759295    630.233627      Asia

<br>

- Access multiple rows of DataFrame, via `iloc`
    - pass indexes in a list.

In [147]:
df.iloc[[1, 70, 100]]       ## iloc and loc will produce same result because explicit & implicit indexes are same here

         country  year  population continent  life_exp       gdp_cap
1    Afghanistan  1957     9240934      Asia    30.332    820.853030
70     Australia  2002    19546792   Oceania    80.370  30687.754730
100   Bangladesh  1972    70759295      Asia    45.252    630.233627

In [ ]:
df.iloc[[1, 70, 100], "population":"like_exp"]

## â›” this results in ERROR, because iloc accepts integer 0-based indexing for columns as well.
## Column names actually act as the Explicit Indexes !

## So correct way is like this :

In [166]:
df.iloc[[1, 70, 100], 2:5]      ## access certain columns via Slicing

     population continent  life_exp
1       9240934      Asia    30.332
70     19546792   Oceania    80.370
100    70759295      Asia    45.252

In [171]:
df.iloc[[1, 70, 100], [4,0,2]]   ## access certian columns in random order

     life_exp      country  population
1      30.332  Afghanistan     9240934
70     80.370    Australia    19546792
100    45.252   Bangladesh    70759295

- ### How many Ways to access all rows and certain columns :
<br>

    1. `pd.DataFrame(df, columns=['population', 'life_exp', 'gdp_cap'])`<br><br>
    
    2. `df[['time', 'total_bill', 'tip']]`<br><br>
    
    3. `df.loc[:, ['time', 'total_bill', 'tip']]`

<br>

- Get last 4 rows of DataFrame
    - this is similar to `df.tail(4)`
    - `.iloc` supports negative indexing in rows as well in columns.
    - â›” `.loc`could give KEY ERROR if negative index is not found.

In [178]:
df.iloc[-4:]          ## df[-4:]   also gives same result

       country  year  population continent  life_exp     gdp_cap
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [177]:
df.iloc[-10::2 , -2:]

## last 10 rows (with stride of 2) + last 2 columns

      life_exp     gdp_cap
1694    52.358  527.272182
1696    55.635  799.362176
1698    60.363  788.855041
1700    60.377  693.420786
1702    39.989  672.038623

- ### Change index column of dataframe
    - `set_index()`

In [3]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [9]:
temp_df = df.set_index("country")

temp_df

             year  population continent  life_exp     gdp_cap
country
Afghanistan  1952     8425333      Asia    28.801  779.445314
Afghanistan  1957     9240934      Asia    30.332  820.853030
Afghanistan  1962    10267083      Asia    31.997  853.100710
Afghanistan  1967    11537966      Asia    34.020  836.197138
Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...         ...       ...       ...         ...
Zimbabwe     1987     9216418    Africa    62.351  706.157306
Zimbabwe     1992    10704340    Africa    60.377  693.420786
Zimbabwe     1997    11404948    Africa    46.809  792.449960
Zimbabwe     2002    11926563    Africa    39.989  672.038623
Zimbabwe     2007    12311143    Africa    43.487  469.709298

[1704 rows x 5 columns]

In [12]:
temp_df.loc["Afghanistan"]


## shows all rows where index="Afghanistan".
## here, number of rows with index (or, country) = "Afghanistan", are 12

             year  population continent  life_exp     gdp_cap
country
Afghanistan  1952     8425333      Asia    28.801  779.445314
Afghanistan  1957     9240934      Asia    30.332  820.853030
Afghanistan  1962    10267083      Asia    31.997  853.100710
Afghanistan  1967    11537966      Asia    34.020  836.197138
Afghanistan  1972    13079460      Asia    36.088  739.981106
Afghanistan  1977    14880372      Asia    38.438  786.113360
Afghanistan  1982    12881816      Asia    39.854  978.011439
Afghanistan  1987    13867957      Asia    40.822  852.395945
Afghanistan  1992    16317921      Asia    41.674  649.341395
Afghanistan  1997    22227415      Asia    41.763  635.341351
Afghanistan  2002    25268405      Asia    42.129  726.734055
Afghanistan  2007    31889923      Asia    43.828  974.580338

### examples on Series :

<u>Question 1:</u> return a Series object that contains the corresponding frequency in form of each word in the `string`. The indices of series should be the unique words and values should be frequency of those unique words.

Series returned is expected to be sorted by `sort_index()` to sort all words.

In [ ]:
string = "How much wood would a woodchuck chuck if a woodchuck could chuck wood"

In [72]:
ser = pd.Series(string.split())

ser

0           How
1          much
2          wood
3         would
4             a
5     woodchuck
6         chuck
7            if
8             a
9     woodchuck
10        could
11        chuck
12         wood
dtype: object

In [73]:
ser.value_counts()

wood         2
a            2
woodchuck    2
chuck        2
How          1
much         1
would        1
if           1
could        1
dtype: int64

In [75]:
ser.value_counts().sort_index()

How          1
a            2
chuck        2
could        1
if           1
much         1
wood         2
woodchuck    2
would        1
dtype: int64